In [1]:
import pandas as pd
import numpy as np

In [2]:
marks = pd.DataFrame([(101,'Java',60),(102,'Java',80),(102,'Python',76), (104,'Oracle',88)])

In [3]:
marks

     0       1   2
0  101    Java  60
1  102    Java  80
2  102  Python  76
3  104  Oracle  88

In [3]:
marks = pd.DataFrame([(101,'Java',60),(102,'Java',80),(102,'Python',76), (104,'Oracle',88)],
                    columns=['Rollno','Subject','Marks'])

In [5]:
marks

   Rollno Subject  Marks
0     101    Java     60
1     102    Java     80
2     102  Python     76
3     104  Oracle     88

In [6]:
marks.columns

Index(['Rollno', 'Subject', 'Marks'], dtype='object')

In [7]:
marks.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
sales = pd.read_csv('sales.txt')

In [5]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [6]:
sales.shape

(10, 4)

In [7]:
sales.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['Month', 'Book', 'City', 'Units'], dtype='object')]

In [8]:
sales.columns = ['Mon','Book','City','Qty']

In [11]:
sales.dtypes

Mon      object
Book     object
City     object
Qty     float64
dtype: object

In [12]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Mon     10 non-null object
Book    10 non-null object
City    9 non-null object
Qty     9 non-null float64
dtypes: float64(1), object(3)
memory usage: 400.0+ bytes

In [14]:
sales.describe(include='all')

        Mon  Book City        Qty
count    10    10    9   9.000000
unique    3     3    2        NaN
top     JAN  B100  VZG        NaN
freq      4     6    5        NaN
mean    NaN   NaN  NaN  16.111111
std     NaN   NaN  NaN  12.046207
min     NaN   NaN  NaN   4.000000
25%     NaN   NaN  NaN  10.000000
50%     NaN   NaN  NaN  13.000000
75%     NaN   NaN  NaN  20.000000
max     NaN   NaN  NaN  40.000000

In [18]:
sales['City'].unique()

array(['VZG', 'HYD', nan], dtype=object)

In [26]:
cities = sales['City'].values
type(cities)

numpy.ndarray

In [40]:
sales.loc[ sales['Book'] == 'B100',['City','Qty']]

  City   Qty
0  VZG  10.0
2  VZG   4.0
3  VZG  13.0
4  HYD  30.0
5  HYD  40.0
6  HYD  10.0

In [35]:
sales['Book'] == 'B100'

0     True
1    False
2     True
3     True
4     True
5     True
6     True
7    False
8    False
9    False
Name: Book, dtype: bool

In [45]:
sales.iloc[2:4,2:4]

  City   Qty
2  VZG   4.0
3  VZG  13.0

In [46]:
sales

   Mon  Book City   Qty
0  JAN  B100  VZG  10.0
1  JAN  B300  VZG  20.0
2  FEB  B100  VZG   4.0
3  MAR  B100  VZG  13.0
4  JAN  B100  HYD  30.0
5  FEB  B100  HYD  40.0
6  MAR  B100  HYD  10.0
7  JAN  B200  VZG  14.0
8  FEB  B200  HYD   NaN
9  MAR  B200  NaN   4.0